{ 
  "menu": {
      "title":"AnakMami",
      "home": "ホーム",
      "about": "概要",
      "project": "プロジェクト",
      "sale": "セール"    
    },
    "home":{
      "description_1": "はじめまして。私の名前はファトニ・ワセソ・ジャティです。トニーと呼んでください。インドネシアのスラカルタ出身です。テレコム大学でコンピュータ工学を専攻し、卒業しました。",
      "description_2": "ソフトウェアエンジニアとして3年間の経験があり、React.jsやNext.jsを使用したモダンでレスポンシブなWeb UIの構築に携わっています。フロントエンドをNode.jsやNest.jsを用いた安全でスケーラブルなREST APIと統合することに精通しています。",
      "see_more": "もっと詳しく",
      "title":"私は ",
      "name_1": "ファトニ",
      "name_2": "ワセソ",
      "name_3": "ジャティ"
    },
    "about": {
      "title": "私について",
      "desc": "ここでは、私のスキルについて詳しく知ることができます。",
      "desc_1": "私はWebアプリケーションとAIに情熱を持つ開発者です。洗練されたデザインと強固なエンジニアリングを組み合わせた、使いやすいUIの構築を得意としています。私の目標は、快適で直感的なUIを設計し、高パフォーマンス・スケーラブル・安全性の高いバックエンド開発を実現することです。",
      "desc_2": "現在、金融系企業でソフトウェアエンジニアとして働いており、約3年の経験があります。フロントエンドとバックエンドのUI設計・開発・ドキュメント作成・保守を担当し、クリーンで分かりやすいコードとベストプラクティスを徹底することで、最適なユーザー体験を提供しています。",
      "desc_3": "これまでに、オンライン決済、税務システム、旅行予約、CRMなど、さまざまなWebアプリケーションを開発してきました。また、TokopediaやArtajasaなどの主要パートナー向けにAPIの開発・運用も行いました。現在、ソフトウェアエンジニアまたはAI関連の職種を探しており、スキルを磨きながら成長し、パートナー企業に貢献できる環境を求めています。"
    },
    "project":{
      "title": "プロジェクト",
      "desc": "ここでは、メニューからプロジェクトを選択できます。",
      "project_title_1": "銀行向け支払いポイント（PPOB）",
      "project_description_1": "ゲームバウチャー、電気料金、水道料金、税金などのサービスを含む、銀行向け支払いポイント（PPOB）取引のためのREST APIを開発しました。PHPおよびTypeScriptを使用したNode.jsでTokopediaやArtajasaとの統合を管理し、円滑な運用を実現しました。また、JWT認証や非対称暗号化などの高度なセキュリティプロトコルを実装しました。Next.jsとMUIを使用して、パートナー向けのシームレスでレスポンシブなPPOBウェブアプリケーションを設計・開発しました。また、Nest.jsを用いた安全なREST APIを実装し、フロントエンド機能を効率的にサポートしながら、堅牢なデータフローを確保しました。",
      "project_sub_1": "このプロジェクトは、電気・水道・税金のオンライン決済や、OVOやDanaなどの電子ウォレットを含む銀行振込に対応したシステムです",
      "project_title_2": "旅行予約",
      "project_description_2": "鉄道、航空機、船舶のチケット予約を含む旅行サービス向けのウェブアプリケーションを設計・開発しました。フロントエンドにはReact.jsを使用し、バックエンドにはNode.jsを用いた安全なREST APIを開発しました。JWT認証を導入し、データセキュリティを確保しました。",
      "project_sub_2" : "このプロジェクトは、フライト、列車、Pelni船、DLU船のオンライン旅行予約に対応したウェブ埋め込みシステムであり、パートナーが簡単に統合できるように設計されています。",
      "project_title_3": "Flazzカード決済",
      "project_description_3": "BCAおよびBNIのFlazz統合用REST APIを開発し、請求処理にはJava Servletを、パートナー向けAPIサービスにはNode.jsを活用しました。モバイルおよびウェブプラットフォームの両方でタップ決済を可能にし、決済プロセスを効率化しました。",
      "project_sub_3": "このプロジェクトは、RFID（無線周波数識別）チップ技術を搭載した多機能取引カード向けのAPIを提供し、請求代行業者を通じたキャッシュレス決済を促進します。",
      "project_title_4": "自動取引コールバック",
      "project_description_4": "保留中の取引を管理するためのTypeScriptによるコールバックAPIを開発しました。数分以内にコールバックを提供し、ユーザーの要件に応じたカスタマイズ可能なフォーマットを実装することで、スムーズな取引処理を実現しました。",
      "project_sub_4":"このプロジェクトは、保留中の取引を再試行し、パートナーにレスポンスを送信します。",
      "project_title_5": "航空機向け気象情報配信システム",
      "project_description_5": "Aerodrome ATISなどのシステムサービスを設計・開発し、Pythonを使用して空港周辺の気象データを解析・処理しました。ATISシステムは、処理されたデータを自動的に航空機へ配信し、周囲の気象状況を通知する仕組みを提供しました。",
      "project_sub_5":"このプロジェクトは、天気データをテキストから音声に変換し、航空機へ放送します。",
      "project_title_6": "電力消費予測システム",
      "project_description_6": "スマートメーターの開発に関する研究プロジェクトを完了しました。LSTMアルゴリズムを用いた電力消費予測システムを開発し、Laravel PHPフレームワークを使用してウェブアプリケーションを構築・維持しました。また、リアルタイムデータの交換と制御を可能にするため、REST APIと統合しました。",
      "project_sub_6":"このプロジェクトは、電気トークンのチャージと使用時間の予測ができるスマートメーターシステムです。"
    }
}
